# IModuleMaker Methods

---
The IModuleMaker type exposes the following members.
| Name| Description
---|---|---
| Execute|  The method that Revit will invoke to create module project. When implementing this interface, programmer is responsible for making it exception-free
Top
#### Reference
IModuleMaker Interface
Autodesk.Revit.DB.Macros Namespace